# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# PrimeTime STA run script for top
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

########################
# Setup

set module_name top
set n-bits 8
set library hvt ;#hvt lvt rvt  high, low, regular?
set speed ff ;#ff ss tt: fast slow and typical
set voltage 0p85 ;# 
set temperature 25 ;# 24 n40 125


#source ./common_setup.tcl
#source ./pt_setup.tcl

# Allow source to use search_path
#set sh_source_uses_search_path true

# Do not allow black boxes for unresolved references
set link_create_black_boxes false


########################
# READ and LINK
set search_path "$search_path . ./rtl/ ./libs/stdcell_${library}/db_nldm/"
set link_path "* saed32${library}_${speed}${voltage}v${temperature}c.db"

# The lab1.v is the netlist generated by DC. The command used "write_file -format verilog -hierarchy -out outputs/lab1.v"
read_verilog ./my_run/mapped_${module_name}${n-bits}bits_${library}_${speed}${voltage}v${temperature}c.v
link_design ${module_name}_WIDTH${n-bits}

# The parasitics.spef was generated by DC using the command "write_parasitics -output ./outputs/parasitics.spef"
read_parasitics ./my_run/parasitics_${module_name}${n-bits}bits_${library}_${speed}${voltage}v${temperature}c.spef

########################
# Apply constraints

# The lab1.sdc was generated by DC using the command "write_sdc ./outputs/lab1.sdc"
# lab1.sdc contained all constraints defined at synthesis stage.
read_sdc -echo ./my_run/mapped_${module_name}${n-bits}bits_${library}_${speed}${voltage}v${temperature}c.sdc

report_analysis_coverage

########################
# Save session

file delete -force ./my_run/pm_session_${module_name}${n-bits}bits_${library}_${speed}${voltage}v${temperature}c
save_session ./my_run/pm_session_${module_name}${n-bits}bits_${library}_${speed}${voltage}v${temperature}c

quit
